[
	{
		"path": "images/projects/tb-100Danish.jpg",
		"alt": "100Danish",
		"title": "100Danish",
		"description": "Boston based WebAgency specialize in responsive design and great data visualization",
		"link": "http://www.100danish.com/",
		"descriptionLong": "",
		"tags": "css3 | animation | jQuery | Gulp | Wordpress | BEM"
	},
	{
		"path": "images/projects/tb-devolute.jpg",
		"alt": "devolute",
		"title": "Devolute",
		"description": "Web Agency based in Berlin, focus on delivering Ruby on Rails apps with an agile methods",
		"link": "http://devolute.org/en/service",
		"descriptionLong": "",
		"tags": "sass | clean code | modular code | animation | refactoring | BEM"
	},
	{
		"path": "images/projects/tb-wine-catalouge.jpg",
		"alt": "Wine catalouge",
		"title": "Wine catalouge",
		"description": "Wine Catalouge with admin section develop in Reactjs and Expressjs. Wine Catalouge is a personal project",
		"link": "http://github.com/gsambrotta/wine-catalogue",
		"descriptionLong": "",
		"tags": "Reactjs | React Router | javascript | ES6 | Webpack | Nodejs | Expressjs"
	},
	{
		"path": "images/projects/tb-social-dashboard.jpg",
		"alt": "Social dashboard",
		"title": "Social dashboard",
		"description": "Social activity monitoring dashboard develop with Reactjs, Webpack and data visualization. Personal project.",
		"link": "http://github.com/gsambrotta/nuvi-dashboard-code-project",
		"descriptionLong": ""
,		"tags": "Reactjs | data visualization | css3 | Webpack | ES6 | Expressjs"
	},
	{
		"path": "images/projects/tb-bathtime.png",
		"alt": "bathtime",
		"title": "Bathtime",
		"description": "Ecommerce based in Prestashop offering natural body care products with delivery and tax system",
		"link": "http://bathtime.de",
		"descriptionLong":
		"Bathtime \n is a ecommerce based on Prestashop platform, selling natural and cruelty free products for body care. \r I follow the entir project, from customer communications to environments setting up (production, stage and local), to actual functionality development. \n I coordinate another developer for the design and templating side. To collaborate and share our code, i set up a git hooks system in order to automatically add our code and database changes to the repo everytime we push or pull.\n Most intensive part of this project was the connection with payment system, delivery system and Amazon. THese connection required me a lot of reserach and testing.",
		"tags": "js | css | html5 | Prestashop"
	},
	{
		"path": "images/projects/tb-boatify.png",
		"alt": "boatify",
		"title": "Boatify",
		"description": "Platform offering boat rental in Airbnb style. I help releasing the MVP, made with jQeury and Php.",
		"link": "http://boatify.me",
		"descriptionLong":
		"Boatify \n is a young startup which aim to offer boat rental for baot experience, daily trip or overnight adventure. \r At the beginning of Boatify adventure, i wroked as solo Frontend Developer, in collaboration with a Backend Developer. The platform was made in php, Rest API, plain javascript/jquery and sass. I took care about everything Frontend related, from templating to animation and calculation until validation and responsivness. \n Work at boatify was always under timing pressure and was interesting to find the way to have the best code and architectural result with few time and higest modification-request margin. \n Very challenging was the development of the booking schedule calendar, done on top of Fullcalendar plugin.",
		"tags": "jQuery | js | css | html5 | Restful API | BEM"
	},
	{
		"path": "images/projects/tb-dit.png",
		"alt": "das ist thueringen",
		"title": "Thueringen a la kart",
		"description": "Interactive map for Thueringen region in Germany made with points of interest",
		"link": "http://www.das-ist-thueringen.de/de/thueringen-a-la-kart",
		"descriptionLong":
		"Thueringen a la kart \n As integration of the Thueringen website, the interactive map allow users to discover which interesting point is present in the region. \r The map is based on OpenStreet Map and Leaflet API with custom menu filter and marker aggregator. The menu is also completely responsive. \n Behind this map there is big research work into Leaflet API. Filter is completely custom and it was interesting to combine it with the Leafletjs. \n Additionaly, the map is part of CMS, Alchemy CMS; basic familiarity with this tool was also part of the work.",
		"tags": "Js | Leafletjs | jQuery | Opensource Map | Sass"
	},
	{
		"path": "images/projects/tb-buzzfeed.png",
		"alt": "buzzfeed",
		"title": "BuzzFeed",
		"description": "Renomate news and entertainment platform. I was part of the refactoring team as Frontend Developer",
		"link": "http://www.buzzfeed.com/",
		"descriptionLong":
		"BuzzFeed \n I worked with Buzzfeed as memeber of SASS & Frontend Architectural Refactor Team. \r We worked hard to refactor the platform from legacy code to organised Css Architecture. We worked with BEM technique. \n There i also ha dthe chance to experiment many new technique and find best practice always taking care about old browsers support. \n My work at BuzzFeed was entirly remote and good communications skills were key part for the success of our team.",
		"tags": "sass | html5 | Js/Prototype | modular code | refactoring | clean code | BEM"
	},
	{
		"path": "images/projects/tb-extrapaddle.png",
		"alt": "Extrapaddle",
		"title": "Extra Paddle",
		"description": "MVP of a platform with social network functionality developed with Backbone connected to Ruby on Rails backend",
		"link": "http://extrapaddle.com/",
		"descriptionLong":
		"I followed this project at its early stage. Starting from the UX and user focus reserach, I developed a the workflow with wireframes, then I designed them in a Photoshop mockups. When the mockups were ready I start to work on the user interface developing the single page app with Backbone.js and the static website with jQuery, Html5 and sass.",
		"tags": "js | sass | html5 | Backbonejs | Grunt"

	},
	{
		"path": "images/projects/tb-artrank.jpg",
		"alt": "Artist Rank",
		"title": "ARTRANK",
		"description": "Platform for rating artists and various art category made in Ember.js. Personal project.",
		"link": "https://github.com/gsambrotta/mini-js-/tree/master/artistRaking",
		"descriptionLong":
		"Project made during hackership program, a program promote from OpenTechSchool where developers stay full-time in a distraction-free learning environment together with other peers for learn more about a certain topic. <br> I decided to improve my Javascript skills and learn two javascript framework: Ember and Backbone. <br> This project is a platform following the wiki idea where the community add information everytime about certains artists and than vote for the various categories in order to have the best and the worst of each category, made by users.",
		"tags": "js | sass | html5 | Emberjs"
	},
	{
		"path": "images/projects/tb-vanilla-calendar.jpg",
		"alt": "Vanilla Javascript Calendar",
		"title": "Vanilla Javascript Calendar",
		"description": "Calendar made with vanilla Javascript is a pet project done to refine my skills",
		"link": "https://github.com/gsambrotta/js-webcalendar",
		"descriptionLong":
		"Bathtime \n is a ecommerce based on Prestashop platform, selling natural and cruelty free products for body care. \r I follow the entir project, from customer communications to environments setting up (production, stage and local), to actual functionality development. \n I coordinate another developer for the design and templating side. To collaborate and share our code, i set up a git hooks system in order to automatically add our code and database changes to the repo everytime we push or pull.\n Most intensive part of this project was the connection with payment system, delivery system and Amazon. THese connection required me a lot of reserach and testing.",
		"tags": "vanilla javascript"
	},
	{
		"path": "images/projects/tb-backbonecomm.jpg",
		"alt": "Comment App",
		"title": "CHAT APP",
		"description": "Comment Form made with backbone.js. Pet project to learning backbone framewrok.",
		"link": "http://designbygio.it/backbone-comment/",
		"descriptionLong":
		"Project made during an hackaton in a team with Rubil on Rails developer and a designer. <br /> BookBeat is an app connected with Readmill API, the user is drive through the process to find the right track for a book choosen from him/her.",
		"tags": "js | css | html5 | backbone"
	},
	{
		"path": "images/projects/tb-bookbeat.jpg",
		"alt": "Book Beat",
		"title": "BOOK BEAT",
		"description": "Hackatons app connected to Readmill API which match sound tracks with book.",
		"link": "https://github.com/jharzmann/BookBeat",
		"descriptionLong":
		"Project made during an hackaton in a team with Rubil on Rails developer and a designer. <br /> BookBeat is an app connected with Readmill API, the user is drive through the process to find the right track for a book choosen from him/her.",

		"tags": "jQuery | css | html5 | Ruby on Rails | Readmill API"
	},
	{
		"path": "images/projects/tb-dragdrop.jpg",
		"alt": "Drag and drop",
		"title": "Drag&Drop Html5",
		"description": "Mozilla contest aim to create something with Drag and Drop html5",
		"link": "/drag_drop",
		"descriptionLong": "Online vinilys shopping developed for Mozilla Contest. <br />The drag and drop functionality is all develop in Html5",
		"tags": "html5 | drag and drop html5"
	},
	{
		"path": "images/projects/tb-validation.jpg",
		"alt": "Validation form",
		"title": "Signin with Validation",
		"description": "SignIn Form with validation. Pet project to exercise with object modular pattern.",
		"link": "http://designbygio.it/validation-form/form-val.html",
		"descriptionLong": "Sign in form with validation client-side. <br /> In the project there is a particular attention to the UI/UX. The user can see his/her password and have different and appropriate error message for each field. <br /> Developed in Javascript/Jquery making an Ajax request.",
		"tags": "jQuery | modular pattern | OOP | css | html5 "
	}
]
